; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	infrared1 - mode
	infrared2 - mode
	spectrograph0 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation5 - direction
	GroundStation8 - direction
	GroundStation10 - direction
	Star6 - direction
	Star9 - direction
	GroundStation7 - direction
	GroundStation14 - direction
	Star4 - direction
	GroundStation12 - direction
	GroundStation13 - direction
	Star11 - direction
	Star2 - direction
	GroundStation3 - direction
	Phenomenon15 - direction
	Star16 - direction
	Star17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star6)
	(supports instrument1 infrared2)
	(supports instrument1 infrared1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation12)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 GroundStation14)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 Star9)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
	(supports instrument2 infrared1)
	(supports instrument2 infrared2)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star11)
	(calibration_target instrument2 GroundStation13)
	(supports instrument3 spectrograph0)
	(supports instrument3 infrared2)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 Star2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation13)
)
(:goal (and
	(have_image Phenomenon15 spectrograph0)
	(have_image Star16 infrared1)
	(have_image Star17 infrared2)
	(have_image Planet18 spectrograph0)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 4
2. (calibrate satellite1 instrument2 groundstation13)
   added: (calibrated instrument2)
   goals met: 0 of 4
3. (turn_to satellite1 planet18 groundstation13)
   deleted: (pointing satellite1 groundstation13)
   added: (pointing satellite1 planet18)
   goals met: 0 of 4
4. (take_image satellite1 planet18 instrument2 spectrograph0)
   added: (have_image planet18 spectrograph0)
   goals met: 1 of 4
5. (turn_to satellite1 phenomenon15 planet18)
   deleted: (pointing satellite1 planet18)
   added: (pointing satellite1 phenomenon15)
   goals met: 1 of 4
6. (take_image satellite1 phenomenon15 instrument2 spectrograph0)
   added: (have_image phenomenon15 spectrograph0)
   goals met: 2 of 4
7. (turn_to satellite1 star16 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 star16)
   goals met: 2 of 4
8. (take_image satellite1 star16 instrument2 infrared1)
   added: (have_image star16 infrared1)
   goals met: 3 of 4
9. (turn_to satellite1 star17 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 star17)
   goals met: 3 of 4
10. (take_image satellite1 star17 instrument2 infrared2)
   added: (have_image star17 infrared2)
   goals met: 4 of 4
